"""
给定一个数组和滑动窗口的大小，找出所有滑动窗口里数值的最大值。例如，如果输入数组{2,3,4,2,6,2,5,1}及滑动窗口的
大小3，那么一共存在6个滑动窗口，他们的最大值分别为{4,4,6,6,6,5}； 针对数组{2,3,4,2,6,2,5,1}的滑动窗口有以
下6个： {[2,3,4],2,6,2,5,1}， {2,[3,4,2],6,2,5,1}， {2,3,[4,2,6],2,5,1}， {2,3,4,[2,6,2],5,1}，
{2,3,4,2,[6,2,5],1}， {2,3,4,2,6,[2,5,1]}。窗口大于数组长度的时候，返回空

[2,3,4,2,6,2,5,1],3 ==> [4,4,6,6,6,5]
"""
# max函数中可迭代参数不能为空


def maxInWindows(num, size):
    if size > len(num) or len(num) == 0 or size == 0:
        return []
    res = []
    left, right = 0, size-1
    while right < len(num):
        res.append(max(num[left: right+1]))
        left += 1
        right += 1
    return res


print(maxInWindows([2,3,4,2,6,2,5,1],3))